In [1]:
# Ignore Warnings.
import warnings
warnings.filterwarnings("ignore")

# Dependencies
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import datetime as dt
import scipy.stats as st

# Import the data
main_df_atlantic = pd.read_csv('new_data_atlantic.csv')
# main_df.head()
main_df_atlantic.columns
del main_df_atlantic['Unnamed: 0']
main_df_atlantic

,ID,Name,Date,Time,Status,Latitude,Longitude,Maximum Wind
0,AL011851,UNNAMED,1851-06-25,0,HU,28.0N,94.8W,80
1,AL011851,UNNAMED,1851-06-25,600,HU,28.0N,95.4W,80
2,AL011851,UNNAMED,1851-06-25,1200,HU,28.0N,96.0W,80
3,AL011851,UNNAMED,1851-06-25,1800,HU,28.1N,96.5W,80
4,AL011851,UNNAMED,1851-06-25,2100,HU,28.2N,96.8W,80
...,...,...,...,...,...,...,...,...
49100,AL122015,KATE,2015-11-12,1200,EX,41.3N,50.4W,55
49101,AL122015,KATE,2015-11-12,1800,EX,41.9N,49.9W,55
49102,AL122015,KATE,2015-11-13,0,EX,41.5N,49.2W,50
49103,AL122015,KATE,2015-11-13,600,EX,40.8N,47.5W,45
49104,AL122015,KATE,2015-11-13,1200,EX,40.7N,45.4W,45

In [2]:
main_df_atlantic['Month'] = pd.DatetimeIndex(main_df_atlantic['Date']).month_name()
main_df_atlantic['Year'] = pd.DatetimeIndex(main_df_atlantic['Date']).year
HU_df = main_df_atlantic.loc[main_df_atlantic["Status"] == " HU",:]
TS_df= main_df_atlantic.loc[main_df_atlantic["Status"] == " TS",:]
del(HU_df['Date'])
HU_df

,ID,Name,Time,Status,Latitude,Longitude,Maximum Wind,Month,Year
0,AL011851,UNNAMED,0,HU,28.0N,94.8W,80,June,1851
1,AL011851,UNNAMED,600,HU,28.0N,95.4W,80,June,1851
2,AL011851,UNNAMED,1200,HU,28.0N,96.0W,80,June,1851
3,AL011851,UNNAMED,1800,HU,28.1N,96.5W,80,June,1851
4,AL011851,UNNAMED,2100,HU,28.2N,96.8W,80,June,1851
...,...,...,...,...,...,...,...,...,...
49053,AL112015,JOAQUIN,600,HU,40.3N,51.5W,65,October,2015
49094,AL122015,KATE,0,HU,33.1N,71.3W,65,November,2015
49095,AL122015,KATE,600,HU,35.2N,67.6W,70,November,2015
49096,AL122015,KATE,1200,HU,36.2N,62.5W,75,November,2015
49097,AL122015,KATE,1800,HU,37.6N,58.2W,65,November,2015

In [3]:
HU_df = HU_df[['ID', 'Name', 'Month', 'Year', 'Time', 'Status', 'Latitude', 'Longitude', 'Maximum Wind']]
HU_df_by_ID = HU_df.groupby(['ID'])
HU_df_by_ID_maxWind = HU_df_by_ID.max()
HU_df_by_ID_maxWind.head()

,Name,Month,Year,Time,Status,Latitude,Longitude,Maximum Wind
ID,,,,,,,,
AL011851,UNNAMED,June,1851,2100,HU,28.2N,97.0W,80
AL011852,UNNAMED,August,1852,1800,HU,31.2N,88.6W,100
AL011854,UNNAMED,June,1854,1800,HU,26.2N,97.0W,70
AL011855,UNNAMED,August,1855,1200,HU,22.2N,98.0W,90
AL011856,UNNAMED,August,1856,1800,HU,30.0N,91.8W,130

In [8]:
hurr_cat_bins = [0, 74, 95, 110, 129, 156, 157]

# Create the names for the four bins
hurr_cat = ["TS", "1", "2", "3", "4", "5"]
HU_df_by_ID_maxWind['Category'] = pd.cut(HU_df_by_ID_maxWind['Maximum Wind'], hurr_cat_bins, labels=hurr_cat)
HU_df_by_ID_maxWind.head()

,Name,Month,Year,Time,Status,Latitude,Longitude,Maximum Wind,Category
ID,,,,,,,,,
AL011851,UNNAMED,June,1851,2100,HU,28.2N,97.0W,80,1
AL011852,UNNAMED,August,1852,1800,HU,31.2N,88.6W,100,2
AL011854,UNNAMED,June,1854,1800,HU,26.2N,97.0W,70,TS
AL011855,UNNAMED,August,1855,1200,HU,22.2N,98.0W,90,1
AL011856,UNNAMED,August,1856,1800,HU,30.0N,91.8W,130,4

In [28]:
HU_yearly = HU_df_by_ID_maxWind.groupby(['Year', 'Category']).count()
HU_yearly = HU_yearly.replace(np.NaN, 0)

In [29]:
HU_yearly.loc[1851, 'Name']

Category
TS    0.0
1     2.0
2     1.0
3     0.0
4     0.0
5     0.0
Name: Name, dtype: float64

In [50]:
HU_yearly.head()

               Name  Month  Time  Status  Latitude  Longitude  Maximum Wind
Year Category
1851 TS         0.0    0.0   0.0     0.0       0.0        0.0           0.0
     1          2.0    2.0   2.0     2.0       2.0        2.0           2.0
     2          1.0    1.0   1.0     1.0       1.0        1.0           1.0
     3          0.0    0.0   0.0     0.0       0.0        0.0           0.0
     4          0.0    0.0   0.0     0.0       0.0        0.0           0.0

In [62]:
HU_yearly.loc[(list_x_axis_ft,'1'), 'Name'].reset_index(level=0, drop=True)

Category
1    2.0
1    2.0
1    1.0
1    1.0
1    2.0
    ...
1    1.0
1    6.0
1    2.0
1    2.0
1    2.0
Name: Name, Length: 163, dtype: float64

In [48]:
list_x_axis = [label[0] for label in HU_yearly.index]
list_x_axis_ft = []

for each_label in list_x_axis:
    if each_label not in list_x_axis_ft:
        list_x_axis_ft.append(each_label)
list_x_axis_ft

[1851,
 1852,
 1853,
 1854,
 1855,
 1856,
 1857,
 1858,
 1859,
 1860,
 1861,
 1862,
 1863,
 1864,
 1865,
 1866,
 1867,
 1868,
 1869,
 1870,
 1871,
 1872,
 1873,
 1874,
 1875,
 1876,
 1877,
 1878,
 1879,
 1880,
 1881,
 1882,
 1883,
 1884,
 1885,
 1886,
 1887,
 1888,
 1889,
 1890,
 1891,
 1892,
 1893,
 1894,
 1895,
 1896,
 1897,
 1898,
 1899,
 1900,
 1901,
 1902,
 1903,
 1904,
 1905,
 1906,
 1908,
 1909,
 1910,
 1911,
 1912,
 1913,
 1915,
 1916,
 1917,
 1918,
 1919,
 1920,
 1921,
 1922,
 1923,
 1924,
 1925,
 1926,
 1927,
 1928,
 1929,
 1930,
 1931,
 1932,
 1933,
 1934,
 1935,
 1936,
 1937,
 1938,
 1939,
 1940,
 1941,
 1942,
 1943,
 1944,
 1945,
 1946,
 1947,
 1948,
 1949,
 1950,
 1951,
 1952,
 1953,
 1954,
 1955,
 1956,
 1957,
 1958,
 1959,
 1960,
 1961,
 1962,
 1963,
 1964,
 1965,
 1966,
 1967,
 1968,
 1969,
 1970,
 1971,
 1972,
 1973,
 1974,
 1975,
 1976,
 1977,
 1978,
 1979,
 1980,
 1981,
 1982,
 1983,
 1984,
 1985,
 1986,
 1987,
 1988,
 1989,
 1990,
 1991,
 1992,
 1993,
 1994,
 1995,
 1996,
 1997,
 1998,
 1999,
 2000,
 2001,
 2002,
 2003,
 2004,
 2005,
 2006,
 2007,
 2008,
 2009,
 2010,
 2011,
 2012,
 2013,
 2014,
 2015]

In [ ]:
labels = list_x_axis_ft
cat1 = [20, 34, 30, 35, 27]
cat2 = [25, 32, 34, 20, 25]

x = np.arange(len(labels))  # the label locations
width = 0.35  # the width of the bars

fig, ax = plt.subplots()
rects1 = ax.bar(x - width/2, men_means, width, label='Men')
rects2 = ax.bar(x + width/2, women_means, width, label='Women')

# Add some text for labels, title and custom x-axis tick labels, etc.
ax.set_ylabel('Scores')
ax.set_title('Scores by group and gender')
ax.set_xticks(x)
ax.set_xticklabels(labels)
ax.legend()


def autolabel(rects):
    """Attach a text label above each bar in *rects*, displaying its height."""
    for rect in rects:
        height = rect.get_height()
        ax.annotate('{}'.format(height),
                    xy=(rect.get_x() + rect.get_width() / 2, height),
                    xytext=(0, 3),  # 3 points vertical offset
                    textcoords="offset points",
                    ha='center', va='bottom')


autolabel(rects1)
autolabel(rects2)

fig.tight_layout()

plt.show()